tests/PaymentTest.yml

SilverStripe\Omnipay\Model\Payment:
  payment1:
    Gateway: Manual
    MoneyAmount: 20.23
    MoneyCurrency: NZD
    Status: Created
    Created: '2013-10-10 12:00:00'
    Identifier: ce3a0b03349078d8e85d1de8ded3f0
  payment2:
    Gateway: PaymentExpress_PxPay
    MoneyAmount: 1234.56
    MoneyCurrency: USD
    Status: PendingPurchase
    Identifier: UNIQUEHASH23q5123tqasdf
    SuccessUrl: 'shop/complete'
    FailureUrl: 'shop/incomplete'
  payment3:
    Gateway: PaymentExpress_PxPay
    MoneyAmount: 769.50
    MoneyCurrency: AUD
    Status: Captured
    Identifier: c3b502a48a4740c063e1732de4cc8077
    TransactionReference: paymentReceipt
  payment4:
    Gateway: UknownGateway
    MoneyAmount: 2.50
    MoneyCurrency: NZD
    Status: Captured
  payment5:
    Gateway: PaymentExpress_PxPay
    MoneyAmount: 1234.56
    MoneyCurrency: USD
    Status: PendingAuthorization
    Identifier: 62b26e0a8a77f60cce3e9a7994087b0e
    SuccessUrl: 'shop/complete'
    FailureUrl: 'shop/incomplete'
  payment6:
    Gateway: PaymentExpress_PxPay
    MoneyAmount: 123.45
    MoneyCurrency: USD
    Status: Authorized
    Identifier: 51efcc0e94718dd80d97b1281762a9bc
    TransactionReference: authorizedPaymentReceipt
  payment7:
    Gateway: PaymentExpress_PxPay
    MoneyAmount: 1234.56
    MoneyCurrency: USD
    Status: PendingCreateCard
    Identifier: 18f2fcac2b8f7549fd0295b251d9e9db
    SuccessUrl: 'shop/complete'
    FailureUrl: 'shop/incomplete'
SilverStripe\Omnipay\Model\Message\PurchaseRequest:
  message1:
    PaymentID: '=>SilverStripe\Omnipay\Model\Payment.payment2'
SilverStripe\Omnipay\Model\Message\PurchaseRedirectResponse:
  message2:
    PaymentID: '=>SilverStripe\Omnipay\Model\Payment.payment2'
SilverStripe\Omnipay\Model\Message\AuthorizeRequest:
  message3:
    PaymentID: '=>SilverStripe\Omnipay\Model\Payment.payment5'
SilverStripe\Omnipay\Model\Message\AuthorizeRedirectResponse:
  message4:
    PaymentID: '=>SilverStripe\Omnipay\Model\Payment.payment5'
SilverStripe\Omnipay\Model\Message\PurchasedResponse:
  message5:
    Reference: paymentReceipt
    PaymentID: '=>SilverStripe\Omnipay\Model\Payment.payment3'
SilverStripe\Omnipay\Model\Message\AuthorizedResponse:
  message6:
    Reference: authorizedPaymentReceipt
    PaymentID: '=>SilverStripe\Omnipay\Model\Payment.payment6'
SilverStripe\Omnipay\Model\Message\CreateCardResponse:
  message7:
    Reference: createCardPaymentReceipt
    PaymentID: '=>SilverStripe\Omnipay\Model\Payment.payment7'

